/*
 1005 : 0을 만들자 - Small
 
 문제 설명
 길이 n인 정수 순열이 주어 졌을 때, 그 안에 숫자를 3개 골라서 합이 0(Zero) 이 되는 조합이 몇 개 있는지 출력하는 프로그램을 만들어 주세요.
 
 만약 입력으로 [-3, -2, 0, 1, 1, 2, 3] 이 주어 졌을 때, 합이 0이 되는 조합은 (-3, 1, 2), (-2, 1, 1), (-2, 0, 2), ﻿(-3, 0, 3) ﻿ 으로 총 4 개가 있습니다.
 
 만약 입력이 [1, 1, 0, -1, -1] 일 경우 0이 되는 조합은 (1, 0, -1) 밖에 없으므로, 답은 1이 됩니다.
 
 입력
 첫줄에 입력되는 정수 순열의 갯수 N이 주어집니다. (0 <= N <= 300)
 
 두번째 줄에 N개의 숫자가 오름차순으로 주어지며, 각 숫자는 공백으로 구분되어 주어집니다.
 
 3개의 숫자 합이 32 bit signed interger 범위를 벗어나는 일은 없다고 가정해도 좋습니다.
 
 출력
 합이 0이 되는 조합이 몇개 있는지를 첫줄에 출력 해 주세요.
 
 입력 예시
 7
 -3 -2 0 1 1 2 3
 출력 예시
 4
 
 */
